[
  {"id": "UT-001", "log": "Mains leak at SW1A 1AA, reported 14:00. High pressure. Requires immediate shutoff. Specialist team required."},
  {"id": "UT-002", "log": "Routine check-up on G1 2QN. No issues found. System performing within standard parameters. Next service Oct 2026."},
  {"id": "UT-003", "log": "Slight rattle in the primary pump at the station near EH1 2NG. Doesn't look urgent but should be checked in the next month."},
  {"id": "UT-004", "log": "EMERGENCY: Pipe burst at the junction of High St and Station Rd (B1 1BB). Water flooding local shops. Urgency: 5."},
  {"id": "UT-005", "log": "Customer query regarding meter reading in Cardiff. No fault found. Postcode unknown, customer was on mobile."},
  {"id": "UT-006", "log": "Corrosion detected on external valve at LS1 4DY. Urgency is probably a 3. Schedule for repair within 14 days."},
  {"id": "UT-007", "log": "Standard inspection at site M4 1HQ. All seals intact. Pressure at 4.2 bar."},
  {"id": "UT-008", "log": "Severe structural damage to pump housing after vehicle collision. Location: L1 0AB. CRITICAL. Risk of system failure."},
  {"id": "UT-009", "log": "Low battery on telemetry unit at site near Brighton. Need to swap out the unit. Low priority."},
  {"id": "UT-010", "log": "Smell of gas reported near the school on Oxford St. NO POSTCODE PROVIDED. Immediate attendance requested."},
  {"id": "UT-011", "log": "Vandalism at substation. Graffiti only, but gate left open. Postcode: G42 9AY. Priority: 2."},
  {"id": "UT-012", "log": "Unusual noise reported from transformer at IV1 1AA. Site is remote. May need a drone inspection."},
  {"id": "UT-013", "log": "Scheduled maintenance for the entire block at CF10 1EP. Standard procedure. Category: Inspection."},
  {"id": "UT-014", "log": "Water quality report: slight turbidity in the line near BT7 1NN. Monitoring required over next 48h."},
  {"id": "UT-015", "log": "Total power failure at the industrial estate (NE1 1AD). Businesses affected. High priority backup needed."},
  {"id": "UT-016", "log": "Missing manhole cover on the pavement near the park. Location is NG1 5FW. Public safety hazard."},
  {"id": "UT-017", "log": "General enquiry: customer asking about smart meter roll-out in the PL4 area. Not a fault."},
  {"id": "UT-018", "log": "Vegetation overgrowth encroaching on power lines near S1 1WB. Needs trimming before winter storms."},
  {"id": "UT-019", "log": "Alarm triggered at pump station 4. Postcode: ZE1 0AA. False alarm caused by local wildlife."},
  {"id": "UT-020", "log": "URGENT: Sewage leak identified behind the shopping centre at YO1 7JF. Environment agency notified."},
  {"id": "UT-021", "log": "Planned upgrade of fibre optics at site CB2 1PZ. Work to commence at 08:00 tomorrow."},
  {"id": "UT-022", "log": "Minor leak in the customer-side pipe. Advice given. Address: 12 High St, OX1 4JD."},
  {"id": "UT-023", "log": "Potential gas leak. High priority. Location unknown - caller hung up but signal traced to Manchester area."},
  {"id": "UT-024", "log": "Faulty street light outside 45 Queen St, AB10 1XG. Reported by council. Priority: Low."},
  {"id": "UT-025", "log": "Smart meter installation scheduled for Monday at the property in EX1 1NT."},
  {"id": "UT-026", "log": "Critical failure of the cooling system at the data centre. Postcode: EC1A 1BB. Immediate response triggered."},
  {"id": "UT-027", "log": "Routine survey of the drainage network in the PO1 area. No issues detected."},
  {"id": "UT-028", "log": "Suspicious activity reported near the pylon at TA1 1AA. Security dispatched."},
  {"id": "UT-029", "log": "Frozen pipe reported at a commercial unit in DD1 1AA. No burst yet but high risk given the weather."},
  {"id": "UT-030", "log": "Multiple reports of low water pressure in the SE1 area. Investigating potential burst main."}
]